IDEA StatiCa Open Model
RebarBase.RebarParentElement Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement RebarParentElement { get; set; }
Public Property RebarParentElement As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ RebarParentElement {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
RebarBase Class
IdeaRS.OpenModel.Model Namespace